{
  "metadata": {
    "source_url": "https://www.airindia.com/in/en/travel-information/baggage-guidelines.html",
    "scrape_date": "2025-12-28T14:54:03.691859",
    "filename": "baggage_guidelines.txt",
    "domain": "airindia.com",
    "content_type": "airline_policy"
  },
  "content": {
    "text": "BAGGAGE GUIDELINES\nTrack your lost or delayed checked baggage seamlessly with our new support for Apple AirTag location feature\nLearn More\nKnow Before You Go: Ultimate Guide to Packing for Travel\nWhether you are packing for a solo trip across Europe or taking the family to the Far East, we have all the information you need. You can also find out what you can and cannot carry onboard our flights or what to do if you have done a little extra shopping to take back home.\nCabin or Carry-on Baggage\nNot sure of what you can carry as cabin baggage? Learn more about weight, number of pieces, and what you can take onboard our flights.\nChecked Baggage\nFor all the information you need on checked baggage allowance on domestic and international flights, codeshare flights and interline journeys.\nRestricted Items and Baggage Advisory\nHere is a list of what you can and cannot carry on our flights. You can also read our baggage advisory for a hassle-free travel experience.\nExcess Baggage\nNeed to pack something extra? Find out what you need to do and read up on our excess baggage fees.\nSpecial Baggage\nFlying with your favourite cello or golf kit? Find out how you can carry them by booking an extra seat or cabin baggage.\nLost or Damaged Baggage\nStill waiting for your baggage to arrive? Or has your baggage been damaged or lost? Learn about what we do to ensure your luggage is safe.\nTrack Your Bags\nTrack every move, every mile. Get your luggage’s journey at your fingertips with our new checked baggage tracker feature.\nBaggage Policy for International Airports\nFind information on the baggage acceptance policy of Oman, Bahrain, Sharjah, and Dubai airports.\nBaggage Calculator\nWondering how much luggage you can bring on your trip? With our baggage calculator, you can find out how much you can carry for free and at a price with just a click.\nLUGGAGE LOCATION, NOW AT YOUR FINGERTIPS.\nTrack every move of your checked baggage from drop-off to destination.\nAir India Cargo\nLooking for a way to send your personal belongings? Discover our personal cargo services for your shipping needs.\nUnaccompanied Baggage as Cargo\nSend baggage or parcels on a flight you won’t be on. Or, if you’re shifting, send household items as air freight.\nVisit Cargo Website\nPets as Cargo\nA dog too big to fly in the cabin can travel in a special cargo area designed for live animals. We transport cats and birds as cargo too.\nHuman Remains\nWe offer caring, careful transport for the remains of the deceased.\nMORE POPULAR FLIGHTS\nDomestic Flight\nInternational Flight\nPopular Flights\nLucknow to Delhi Flight\nChennai to Bangalore Flight\nIndore to Delhi Flight\nMumbai to Kolkata Flight\nDelhi to Chennai Flight\nDelhi to Patna Flight\nAhmedabad to Mumbai Flight\nGoa to Mumbai Flight\nChennai to Mumbai Flight\nDelhi to Leh Flight\nDelhi to Guwahati Flight\nMumbai to Chennai Flight\nBangalore to Hyderabad Flight\nMumbai to Ahmedabad Flight\nMumbai to Jaipur Flight\nKolkata to Mumbai Flight\nMumbai to Hyderabad Flight\nHyderabad to Bangalore Flight\nDelhi to Lucknow Flight\nJaipur to Mumbai Flight\nGIFT CARDS\nBOOK & MANAGE\nWHERE WE FLY\nPREPARE TO TRAVEL\nAIR INDIA EXPERIENCE\nMAHARAJA CLUB\nCorporate Information\nFlight Schedule\nNon-stop Flights\nPartner Airlines\nAirport Information\nFirst-time Travellers and Children\nVisas, Documents and Travel Tips\nHealth and Medical Assistance\nTravelling with Pets\nAt The Airport\nIn The Air\nTransforming Experiences\nPoints Calculator\nEarn Points\nRedeem Points\nFrequently Asked Questions\nGrievance Resolution\nEU/UK Flight Delay Claim\nAIR INDIA APP\nDownload the app to book and manage your flights on the go. Learn more\nTerms & Conditions\nPrivacy Notice\nCookie Settings\nConditions of Carriage\nDomestic Fares\nTravel Agents\nPassenger Rights\nDisruption Statement\nAll rights reserved. Use of this website indicates your compliance with our Privacy Notice, Conditions of Carriage, Terms and Conditions.\n\n",
    "length_chars": 3897,
    "length_words": 640,
    "tables_present": false
  },
  "processing_info": {
    "cleaned": true,
    "format": "text_with_tables"
  }
}